#coding:utf-8
def CalEachWordAp(words):  # 文本中记录各词语出现次数r
    d = {}
    for word in words:
        d[word] = 0

    for word in words:
        d[word] += 1
    return d
word = ['一位', '真正', '的', '作家', '永远', '只', '为', '内心', '写作', '，', '只有', '内心', '才', '会', '真实', '地', '告诉', '他', '，', '他', '的', '自私', '、', '他', '的', '高尚', '是', '多么', '突出', '。', '内心', '让', '他', '真实', '地', '了解', '自己', '，', '一旦', '了解', '了', '自己', '也', '就', '了解', '了', '世界', '。', '很多年', '前', '我', '就', '明白', '了', '这个', '原则', '，', '可是', '要', '捍卫', '这个', '原则', '必须', '付出', '艰辛', '的', '劳动', '和', '长', '时期', '的', '痛苦', '，', '因为', '内心', '并非', '时时刻刻', '都', '是', '敞开', '的', '，', '它', '更', '多', '的', '时候', '倒', '是', '封闭', '起来', '，', '于是', '只有', '写作', '，', '不停', '地', '写作', '才能', '使', '内心', '敞开', '，', '才能', '使', '自己', '置身于', '发现', '之中', '，', '就', '像', '日出', '的', '光芒', '照亮', '了', '黑暗', '，', '灵感', '这时候', '才']
dt=CalEachWordAp(word)

print(dt)


